{
  "title": "System Settings",
  "subtitle": "Configure AI prompts and compliance rules for label analysis",
  "loading": "Loading settings...",
  "save": "Save All",
  "saving": "Saving...",
  "saveSuccess": "Settings saved successfully",
  "saveFailed": "Failed to save settings",
  "failedToLoad": "Failed to load settings",
  "tab.prompt": "Master Prompt",
  "tab.common": "Common Rules",
  "tab.us": "US Rules",
  "tab.uk": "UK Rules",
  "tab.eu": "EU Rules",
  "prompt.title": "Master Prompt",
  "prompt.description": "The main AI prompt used to analyze product labels. This prompt instructs Claude on how to analyze labels for compliance. You can customize this to focus on specific aspects or add custom instructions.",
  "prompt.howItWorks": "How It Works",
  "prompt.info": "This master prompt is automatically enhanced with dynamic context including:",
  "prompt.info.category": "Product category information",
  "prompt.info.marketplace": "Target marketplace regulations",
  "prompt.info.rules": "Applicable compliance rules (Common + Country-specific)",
  "prompt.info.note": "The AI will analyze labels using this prompt combined with the relevant rules from the tabs below.",
  "prompt.label": "AI Analysis Prompt",
  "prompt.placeholder": "Enter the master prompt for AI label analysis...",
  "prompt.helper": "Leave empty to use the default prompt. The system will automatically append category, marketplace, and rule information.",
  "common.title": "Common Compliance Rules",
  "common.description": "General compliance rules that apply to all countries/regions. These rules will be included in every analysis regardless of the target marketplace. Use Markdown format for better readability.",
  "common.label": "Common Rules (Markdown)",
  "common.helper": "Markdown formatting supported: headings, lists, bold, italic, links, etc.",
  "us.title": "United States Compliance Rules",
  "us.description": "US-specific compliance rules including FDA, CPSC, CPSIA, and state-specific requirements. These rules will be included when analyzing labels for the US marketplace.",
  "us.label": "US Rules (Markdown)",
  "uk.title": "United Kingdom Compliance Rules",
  "uk.description": "UK-specific compliance rules including UKCA marking, UK CA requirements, and BS EN standards. These rules will be included when analyzing labels for the UK marketplace.",
  "uk.label": "UK Rules (Markdown)",
  "eu.title": "European Union (Germany) Compliance Rules",
  "eu.description": "EU/Germany-specific compliance rules including CE marking, EN standards, and EU regulations. These rules will be included when analyzing labels for EU/German marketplaces.",
  "eu.label": "EU/Germany Rules (Markdown)"
}

