{
  "title": "Configuración del Sistema",
  "subtitle": "Configurar indicaciones de IA y reglas de cumplimiento para análisis de etiquetas",
  "loading": "Cargando configuración...",
  "save": "Guardar Todo",
  "saving": "Guardando...",
  "saveSuccess": "Configuración guardada exitosamente",
  "saveFailed": "Error al guardar configuración",
  "failedToLoad": "Error al cargar configuración",
  "tab.prompt": "Indicación Principal",
  "tab.common": "Reglas Comunes",
  "tab.us": "Reglas de EE.UU.",
  "tab.uk": "Reglas del Reino Unido",
  "tab.eu": "Reglas de la UE",
  "prompt.title": "Indicación Principal",
  "prompt.description": "La indicación principal de IA utilizada para analizar etiquetas de productos. Esta indicación instruye a Claude sobre cómo analizar etiquetas para cumplimiento. Puede personalizarla para enfocarse en aspectos específicos o agregar instrucciones personalizadas.",
  "prompt.howItWorks": "Cómo Funciona",
  "prompt.info": "Esta indicación principal se mejora automáticamente con contexto dinámico que incluye:",
  "prompt.info.category": "Información de categoría de producto",
  "prompt.info.marketplace": "Regulaciones del mercado objetivo",
  "prompt.info.rules": "Reglas de cumplimiento aplicables (Comunes + Específicas del país)",
  "prompt.info.note": "La IA analizará las etiquetas usando esta indicación combinada con las reglas relevantes de las pestañas a continuación.",
  "prompt.label": "Indicación de Análisis de IA",
  "prompt.placeholder": "Ingrese la indicación principal para análisis de etiquetas de IA...",
  "prompt.helper": "Deje vacío para usar la indicación predeterminada. El sistema agregará automáticamente información de categoría, mercado y reglas.",
  "common.title": "Reglas Comunes de Cumplimiento",
  "common.description": "Reglas generales de cumplimiento que se aplican a todos los países/regiones. Estas reglas se incluirán en cada análisis independientemente del mercado objetivo. Use formato Markdown para mejor legibilidad.",
  "common.label": "Reglas Comunes (Markdown)",
  "common.helper": "Formato Markdown compatible: encabezados, listas, negrita, cursiva, enlaces, etc.",
  "us.title": "Reglas de Cumplimiento de Estados Unidos",
  "us.description": "Reglas de cumplimiento específicas de EE.UU. incluyendo FDA, CPSC, CPSIA y requisitos estatales. Estas reglas se incluirán al analizar etiquetas para el mercado de EE.UU.",
  "us.label": "Reglas de EE.UU. (Markdown)",
  "uk.title": "Reglas de Cumplimiento del Reino Unido",
  "uk.description": "Reglas de cumplimiento específicas del Reino Unido incluyendo marcado UKCA, requisitos de UK CA y estándares BS EN. Estas reglas se incluirán al analizar etiquetas para el mercado del Reino Unido.",
  "uk.label": "Reglas del Reino Unido (Markdown)",
  "eu.title": "Reglas de Cumplimiento de la Unión Europea (Alemania)",
  "eu.description": "Reglas de cumplimiento específicas de UE/Alemania incluyendo marcado CE, estándares EN y regulaciones de la UE. Estas reglas se incluirán al analizar etiquetas para mercados de la UE/Alemania.",
  "eu.label": "Reglas de UE/Alemania (Markdown)"
}

