{
  "title": "Paramètres du Système",
  "subtitle": "Configurer les invites IA et les règles de conformité pour l'analyse des étiquettes",
  "loading": "Chargement des paramètres...",
  "save": "Tout Sauvegarder",
  "saving": "Sauvegarde...",
  "saveSuccess": "Paramètres sauvegardés avec succès",
  "saveFailed": "Échec de la sauvegarde des paramètres",
  "failedToLoad": "Échec du chargement des paramètres",
  "tab.prompt": "Invite Principale",
  "tab.common": "Règles Communes",
  "tab.us": "Règles US",
  "tab.uk": "Règles UK",
  "tab.eu": "Règles UE",
  "prompt.title": "Invite Principale",
  "prompt.description": "L'invite IA principale utilisée pour analyser les étiquettes de produits. Cette invite instruit Claude sur la façon d'analyser les étiquettes pour la conformité. Vous pouvez la personnaliser pour vous concentrer sur des aspects spécifiques ou ajouter des instructions personnalisées.",
  "prompt.howItWorks": "Comment Ça Marche",
  "prompt.info": "Cette invite principale est automatiquement enrichie avec un contexte dynamique incluant:",
  "prompt.info.category": "Informations sur la catégorie de produit",
  "prompt.info.marketplace": "Réglementations du marché cible",
  "prompt.info.rules": "Règles de conformité applicables (Communes + Spécifiques au pays)",
  "prompt.info.note": "L'IA analysera les étiquettes en utilisant cette invite combinée avec les règles pertinentes des onglets ci-dessous.",
  "prompt.label": "Invite d'Analyse IA",
  "prompt.placeholder": "Entrez l'invite principale pour l'analyse des étiquettes IA...",
  "prompt.helper": "Laissez vide pour utiliser l'invite par défaut. Le système ajoutera automatiquement les informations de catégorie, de marché et de règles.",
  "common.title": "Règles Communes de Conformité",
  "common.description": "Règles générales de conformité qui s'appliquent à tous les pays/régions. Ces règles seront incluses dans chaque analyse quel que soit le marché cible. Utilisez le format Markdown pour une meilleure lisibilité.",
  "common.label": "Règles Communes (Markdown)",
  "common.helper": "Formatage Markdown supporté: titres, listes, gras, italique, liens, etc.",
  "us.title": "Règles de Conformité des États-Unis",
  "us.description": "Règles de conformité spécifiques aux États-Unis incluant FDA, CPSC, CPSIA et exigences spécifiques à l'État. Ces règles seront incluses lors de l'analyse des étiquettes pour le marché américain.",
  "us.label": "Règles US (Markdown)",
  "uk.title": "Règles de Conformité du Royaume-Uni",
  "uk.description": "Règles de conformité spécifiques au Royaume-Uni incluant le marquage UKCA, les exigences UK CA et les normes BS EN. Ces règles seront incluses lors de l'analyse des étiquettes pour le marché britannique.",
  "uk.label": "Règles UK (Markdown)",
  "eu.title": "Règles de Conformité de l'Union Européenne (Allemagne)",
  "eu.description": "Règles de conformité spécifiques à l'UE/Allemagne incluant le marquage CE, les normes EN et les réglementations de l'UE. Ces règles seront incluses lors de l'analyse des étiquettes pour les marchés de l'UE/Allemagne.",
  "eu.label": "Règles UE/Allemagne (Markdown)"
}

